temcocontrols/T3-programmable-controller-on-ESP32/STM32/Multimeter/USER/ES51932_Driver.c
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"
#include "ES51932_Driver.h"
#include "FreeRTOS.h"
#include "task.h"
#include <string.h>

extern uint16_t test[];
extern uint8_t i2c_send[];

volatile DataPacket receivedData;
volatile uint8_t dataBuffer[14];
volatile uint8_t dataIndex = 0;
uint32_t combinedNumber = 0; // global variable
uint8_t resistanceBytes[4]; // Array to store resistance value as bytes
uint8_t receivedSerialData = 0; // Flag to indicate if serial data has been received

void parseStatus(uint8_t status) {
    uint8_t judge = status & 0x01; // Bit 0
    uint8_t sign = (status >> 1) & 0x01; // Bit 1
    uint8_t batt = (status >> 2) & 0x01; // Bit 2
    uint8_t ol = (status >> 3) & 0x01; // Bit 3

    if (judge == 1) {
        // Temperature unit: °C
        // printf("Temperature unit: °C\n");
    } else {
        // Temperature unit: °F
        // printf("Temperature unit: °F\n");
    }

    if (sign == 1) {
        // Negative sign: On
        // printf("Negative sign: On\n");
    } else {
        // Negative sign: Off
        // printf("Negative sign: Off\n");
    }

    if (batt == 1) {
        // Battery low: Yes
        // printf("Battery low: Yes\n");
    } else {
        // Battery low: No
        // printf("Battery low: No\n");
    }

    if (ol == 1) {
        // Input overflow: Yes
        // printf("Input overflow: Yes\n");
    } else {
        // Input overflow: No
        // printf("Input overflow: No\n");
    }
}

void parseOptions(uint8_t option1, uint8_t option2, uint8_t option3, uint8_t option4) {
    // Parse option1
    uint8_t max = option1 & 0x01; // Bit 0
    uint8_t min = (option1 >> 1) & 0x01; // Bit 1
    uint8_t rmr = (option1 >> 2) & 0x01; // Bit 2
    uint8_t rel = (option1 >> 3) & 0x01; // Bit 3

    if (max == 1) {
        // MAX function is active
        // printf("MAX function: Active\n");
    } else {
        // MAX function is not active
        // printf("MAX function: Inactive\n");
    }

    if (min == 1) {
        // MIN function is active
        // printf("MIN function: Active\n");
    } else {
        // MIN function is not active
        // printf("MIN function: Inactive\n");
    }

    if (rmr == 1) {
        // RMR function is active
        // printf("RMR function: Active\n");
    } else {
        // RMR function is not active
        // printf("RMR function: Inactive\n");
    }

    if (rel == 1) {
        // REL function is active
        // printf("REL function: Active\n");
    } else {
        // REL function is not active
        // printf("REL function: Inactive\n");
    }

    // Parse option2
    uint8_t ul = option2 & 0x01; // Bit 0
    uint8_t pmax = (option2 >> 1) & 0x01; // Bit 1
    uint8_t pmin = (option2 >> 2) & 0x01; // Bit 2

    if (ul == 1) {
        // UL condition is met
        // printf("UL condition: Met\n");
    } else {
        // UL condition is not met
        // printf("UL condition: Not met\n");
    }

    if (pmax == 1) {
        // PMAX is active
        // printf("PMAX: Active\n");
    } else {
        // PMAX is not active
        // printf("PMAX: Inactive\n");
    }

    if (pmin == 1) {
        // PMIN is active
        // printf("PMIN: Active\n");
    } else {
        // PMIN is not active
        // printf("PMIN: Inactive\n");
    }

    // Parse option3
    uint8_t dc = option3 & 0x01; // Bit 0
    uint8_t ac = (option3 >> 1) & 0x01; // Bit 1
    uint8_t auto_mode = (option3 >> 2) & 0x01; // Bit 2

    if (dc == 1) {
        // DC measurement mode
        // printf("DC measurement mode: Active\n");
    } else {
        // DC measurement mode is not active
        // printf("DC measurement mode: Inactive\n");
    }

    if (ac == 1) {
        // AC measurement mode
        // printf("AC measurement mode: Active\n");
    } else {
        // AC measurement mode is not active
        // printf("AC measurement mode: Inactive\n");
    }

    if (auto_mode == 1) {
        // Automatic mode
        // printf("Automatic mode: Active\n");
    } else {
        // Manual mode
        // printf("Manual mode: Active\n");
    }

    // Parse option4
    uint8_t vbar = option4 & 0x01; // Bit 0
    uint8_t hold = (option4 >> 1) & 0x01; // Bit 1
    uint8_t lpf0 = (option4 >> 2) & 0x01; // Bit 2
    uint8_t lpf1 = (option4 >> 3) & 0x01; // Bit 3

    if (vbar == 1) {
        // VBAR pin is connected to V-
        // printf("VBAR: Connected to V-\n");
    } else {
        // VBAR pin is not connected to V-
        // printf("VBAR: Not connected to V-\n");
    }

    if (hold == 1) {
        // Hold mode is active
        // printf("Hold mode: Active\n");
    } else {
        // Hold mode is not active
        // printf("Hold mode: Inactive\n");
    }

    if (lpf0 == 1 && lpf1 == 1) {
        // Low-pass filter feature is activated
        // printf("Low-pass filter: Activated\n");
    } else {
        // Low-pass filter feature is not activated
        // printf("Low-pass filter: Not activated\n");
    }
}

void USART_Configuration(void) {
    USART_InitTypeDef USART_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;
    GPIO_InitTypeDef GPIO_InitStructure;

    // Enable USART3 and GPIO clocks
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

    // Configure USART3 Tx (PB10) as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // Configure USART3 Rx (PB11) as input floating
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // Configure USART3
    USART_InitStructure.USART_BaudRate = ES51932_BAUDRATE;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_Odd;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_Init(USART3, &USART_InitStructure);
		
    // Enable USART3 Receive interrupt
    USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);

    // Configure and enable USART3 interrupt in NVIC
    NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    // Enable USART3
    USART_Cmd(USART3, ENABLE);
}

