temcocontrols/T3-programmable-controller-on-ESP32/STM32/Multimeter/USER/ES51932_Driver.c
void GPIO_Configuration(void) {
    GPIO_InitTypeDef GPIO_InitStructure;

    // Enable GPIO clocks
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOA, ENABLE);

    // Configure PB3, PB4, PB5, PB8, PB9, PB10, PB13, PB14, PB15 as output push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    // Configure PC6, PC7, PC8, PC9, PC10, PC11 as output push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    // Configure PA5, PA6, PA7, PA11, PA12, PA13 as output push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    // Set initial states
    GPIO_SetBits(GPIOB, GPIO_Pin_3); // CH1 off (high)
    GPIO_SetBits(GPIOB, GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_14 | GPIO_Pin_15); // Other PB pins high
    GPIO_SetBits(GPIOB, GPIO_Pin_13); // PB13 high
//    GPIO_ResetBits(GPIOB, GPIO_Pin_14); // PB14 low (DC default)
    GPIO_SetBits(GPIOC, GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9); // PC6, PC7, PC8, PC9 high
    GPIO_ResetBits(GPIOC, GPIO_Pin_10 | GPIO_Pin_11); // PC10, PC11 low

    // Set initial states for PA pins
    GPIO_SetBits(GPIOA, GPIO_Pin_5); // PA5 (FC5) high
    GPIO_SetBits(GPIOA, GPIO_Pin_12 | GPIO_Pin_11 | GPIO_Pin_7 | GPIO_Pin_6); // FC1, FC2, FC3, FC4 high
    GPIO_ResetBits(GPIOA, GPIO_Pin_13); // PA13 (RANGE) low
		
}

void ControlChannels(uint16_t value) {
    // Turn off unselected channels by setting their pins high
    if (value != 1) GPIO_SetBits(GPIOB, GPIO_Pin_3); // Turn off CH1
    if (value != 2) GPIO_SetBits(GPIOB, GPIO_Pin_4); // Turn off CH2
    if (value != 3) GPIO_SetBits(GPIOB, GPIO_Pin_5); // Turn off CH3
    if (value != 4) GPIO_SetBits(GPIOC, GPIO_Pin_6); // Turn off CH4
    if (value != 5) GPIO_SetBits(GPIOC, GPIO_Pin_7); // Turn off CH5
    if (value != 6) GPIO_SetBits(GPIOB, GPIO_Pin_8); // Turn off CH6
    if (value != 7) GPIO_SetBits(GPIOB, GPIO_Pin_9); // Turn off CH7
    if (value != 8) GPIO_SetBits(GPIOB, GPIO_Pin_10); // Turn off CH8

    i2c_send[8]++;
    // Select the specified channel by setting its pin low
    switch (value) {
        case 1:
            GPIO_ResetBits(GPIOB, GPIO_Pin_3); // Select CH1
            break;
        case 2:
            GPIO_ResetBits(GPIOB, GPIO_Pin_4); // Select CH2
            break;
        case 3:
            GPIO_ResetBits(GPIOB, GPIO_Pin_5); // Select CH3
            break;
        case 4:
            GPIO_ResetBits(GPIOC, GPIO_Pin_6); // Select CH4
            break;
        case 5:
            GPIO_ResetBits(GPIOC, GPIO_Pin_7); // Select CH5
            break;
        case 6:
            GPIO_ResetBits(GPIOB, GPIO_Pin_8); // Select CH6
            break;
        case 7:
            GPIO_ResetBits(GPIOB, GPIO_Pin_9); // Select CH7
            break;
        case 8:
            GPIO_ResetBits(GPIOB, GPIO_Pin_10); // Select CH8
            break;
        default:
            GPIO_ResetBits(GPIOB, GPIO_Pin_3); // Default to Select CH1
            break;
    }

    test[248] = value;
    test[249] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_3);  // CH1
    test[250] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_4);  // CH2
    test[251] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_5);  // CH3
    test[252] = GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_6);  // CH4
    test[253] = GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_7);  // CH5
    test[254] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_8);  // CH6
    test[255] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_9);  // CH7
    test[256] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_10); // CH8
}

void SingleControlChannels(uint16_t ch1, uint16_t ch2, uint16_t ch3, uint16_t ch4, uint16_t ch5, uint16_t ch6, uint16_t ch7, uint16_t ch8) {
    // Control CH1
    if (ch1 == 1) {
        GPIO_ResetBits(GPIOB, GPIO_Pin_3); // Select CH1
    } else {
        GPIO_SetBits(GPIOB, GPIO_Pin_3); // Turn off CH1
    }

    // Control CH2
    if (ch2 == 1) {
        GPIO_ResetBits(GPIOB, GPIO_Pin_4); // Select CH2
    } else {
        GPIO_SetBits(GPIOB, GPIO_Pin_4); // Turn off CH2
    }

    // Control CH3
    if (ch3 == 1) {
        GPIO_ResetBits(GPIOB, GPIO_Pin_5); // Select CH3
    } else {
        GPIO_SetBits(GPIOB, GPIO_Pin_5); // Turn off CH3
    }

    // Control CH4
    if (ch4 == 1) {
        GPIO_ResetBits(GPIOC, GPIO_Pin_6); // Select CH4
    } else {
        GPIO_SetBits(GPIOC, GPIO_Pin_6); // Turn off CH4
    }

    // Control CH5
    if (ch5 == 1) {
        GPIO_ResetBits(GPIOC, GPIO_Pin_7); // Select CH5
    } else {
        GPIO_SetBits(GPIOC, GPIO_Pin_7); // Turn off CH5
    }

    // Control CH6
    if (ch6 == 1) {
        GPIO_ResetBits(GPIOB, GPIO_Pin_8); // Select CH6
    } else {
        GPIO_SetBits(GPIOB, GPIO_Pin_8); // Turn off CH6
    }

    // Control CH7
    if (ch7 == 1) {
        GPIO_ResetBits(GPIOB, GPIO_Pin_9); // Select CH7
    } else {
        GPIO_SetBits(GPIOB, GPIO_Pin_9); // Turn off CH7
    }

    // Control CH8
    if (ch8 == 1) {
        GPIO_ResetBits(GPIOB, GPIO_Pin_10); // Select CH8
    } else {
        GPIO_SetBits(GPIOB, GPIO_Pin_10); // Turn off CH8
    }
}

uint8_t decodeDigit(uint8_t digit) {
    switch (digit) {
				case DIGIT_0: 
					return 0;
        case DIGIT_1: 
					return 1;
        case DIGIT_2: 
					return 2;
        case DIGIT_3: 
					return 3;
        case DIGIT_4: 
					return 4;
        case DIGIT_5: 
					return 5;
        case DIGIT_6: 
					return 6;
        case DIGIT_7: 
					return 7;
        case DIGIT_8: 
					return 8;
        case DIGIT_9: 
					return 9;
        default: 
					return 0xFF; // Invalid digit
    }
}

static void ControlSW1(uint16_t sw1) {
    if (sw1 == 1) {
        GPIO_ResetBits(GPIOB, GPIO_Pin_14); // Turn on SW1 (low)
    } else {
        GPIO_SetBits(GPIOB, GPIO_Pin_14); // Turn off SW1 (high)
    }
}

