temcocontrols/T3-programmable-controller-on-ESP32/STM32/Multimeter/USER/ES51932_Driver.c
void ControlSwitches(uint16_t sw2, uint16_t sw3, uint16_t sw4, uint16_t sw5) {
    // Control SW2
    if (sw2 == 1) {
        GPIO_ResetBits(GPIOC, GPIO_Pin_9); // Turn on SW2 (low)
    } else {
        GPIO_SetBits(GPIOC, GPIO_Pin_9); // Turn off SW2 (high)
    }

    // Control SW3
    if (sw3 == 1) {
        GPIO_ResetBits(GPIOC, GPIO_Pin_10); // Turn on SW3 (low)
    } else {
        GPIO_SetBits(GPIOC, GPIO_Pin_10); // Turn off SW3 (high)
    }

    // Control SW4
    if (sw4 == 1) {
        GPIO_ResetBits(GPIOC, GPIO_Pin_11); // Turn on SW4 (low)
    } else {
        GPIO_SetBits(GPIOC, GPIO_Pin_11); // Turn off SW4 (high)
    }

    // Control SW5
    if (sw5 == 1) {
        GPIO_ResetBits(GPIOB, GPIO_Pin_15); // Turn on SW5 (low)
    } else {
        GPIO_SetBits(GPIOB, GPIO_Pin_15); // Turn off SW5 (high)
    }

    test[257] = (sw2 & 0x01) | ((sw3 & 0x01) << 1) |
                ((sw4 & 0x01) << 2) | ((sw5 & 0x01) << 3);
    test[258] = GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_9);  // SW2
    test[259] = GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_10); // SW3
    test[260] = GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_11); // SW4
    test[261] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_15); // SW5
}

extern uint8_t multiChannel;
static uint8_t sequenceNumber = 0;
void ProcessAndConvertResistance(uint8_t *buffer) {
//    uint32_t resistanceValue = 0;

//    if (receivedData.function == FUNCTION_RESISTANCE) {
//        switch (receivedData.range) {
//            case RANGE_220_00_OHM:
//                resistanceValue = combinedNumber * 100; // 220.00 Ohm range
//                break;
//            case RANGE_2_2000K_OHM:
//                resistanceValue = combinedNumber * 1000; // 2.2000K Ohm range
//                break;
//            case RANGE_22_000K_OHM:
//                resistanceValue = combinedNumber * 1000; // 22.0000K Ohm range
//                break;
//            case RANGE_220_00K_OHM:
//                resistanceValue = combinedNumber * 1000; // 220.00K Ohm range
//                break;
//            case RANGE_2_2000M_OHM:
//                resistanceValue = combinedNumber * 1000000; // 2.2000M Ohm range
//                break;
//            case RANGE_22_000M_OHM:
//                resistanceValue = combinedNumber * 1000000; // 22.000M Ohm range
//                break;
//            case RANGE_220_00M_OHM:
//                resistanceValue = combinedNumber * 1000000; // 220.00M Ohm range
//                break;
//            default:
//                // Handle unknown range
//                break;
//        }
//    }

//    // Convert resistance value to bytes and store in buffer
//    buffer[0] = (uint8_t)(resistanceValue >> 24);
//    buffer[1] = (uint8_t)(resistanceValue >> 16);
//    buffer[2] = (uint8_t)(resistanceValue >> 8);
//    buffer[3] = (uint8_t)resistanceValue;

//		// Store the resistance value in test array at index 216 and 217
//    test[216] = (uint16_t)(resistanceValue >> 16);
//    test[217] = (uint16_t)resistanceValue;
    // Print or use the resistance value in ohms as needed
    //printf("Resistance: %u ohms\n", resistanceValue);
    uint32_t resistanceValue = combinedNumber;
		
		//vTaskDelay(400);

    // Convert resistance value to bytes and store in buffer
    buffer[0] = (uint8_t)(resistanceValue >> 24);
    buffer[1] = (uint8_t)(resistanceValue >> 16);
    buffer[2] = (uint8_t)(resistanceValue >> 8);
    buffer[3] = (uint8_t)resistanceValue;

    // Store the range in the fifth byte
    buffer[4] = receivedData.range;

    // Store the channel in the sixth byte
    buffer[5] = multiChannel;

    // Store the sequence number in the seventh byte
    buffer[6] = sequenceNumber;

    // Increment the sequence number for the next message
    sequenceNumber++;


    // Store the resistance value in test array at index 216 and 217
    test[216] = (uint16_t)(resistanceValue >> 16);
    test[217] = (uint16_t)resistanceValue;		
}

void ControlChannelsTask(void *pvParameters) {
    while (1) {
        //ControlChannels(test[220]);
        //SingleControlChannels(test[220], test[221], test[222], test[223], test[224], test[225], test[226], test[227]);
        //ControlSwitches(test[230], test[231], test[232], test[233]);
        //ControlSwitches(0, 1, 1, 0);
        //ProcessAndConvertResistance(i2c_send);
        vTaskDelay(100); // Delay for 100 milliseconds
    }
}

void ES51932_Init(void) {
    // Initialize USART3 and GPIO
    USART_Configuration();
    GPIO_Configuration();

    // Keep the control task enabled; measurement reception runs in USART3_IRQHandler.
    xTaskCreate(ControlChannelsTask, ( signed portCHAR * )"ControlChannelsTask", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY+3, NULL);
	
}

void USART3_IRQHandler(void) {
    if (USART_GetITStatus(USART3, USART_IT_RXNE) != RESET) {
        // Read one byte from the receive data register
        uint8_t data = USART_ReceiveData(USART3);

        // Clear the highest bit (set the first bit to 0)
        data &= 0x7F;
			
        // Store received data in buffer
        dataBuffer[dataIndex++] = data;

        // Check if we have received a full packet
        if (dataIndex >= 14) {
            // Copy buffer to receivedData structure
            receivedData.range = dataBuffer[0];
            receivedData.digit4 = dataBuffer[1];
            receivedData.digit3 = dataBuffer[2];
            receivedData.digit2 = dataBuffer[3];
            receivedData.digit1 = dataBuffer[4];
            receivedData.digit0 = dataBuffer[5];
            receivedData.function = dataBuffer[6];
            receivedData.status = dataBuffer[7];
            receivedData.option1 = dataBuffer[8];
            receivedData.option2 = dataBuffer[9];
            receivedData.option3 = dataBuffer[10];
            receivedData.option4 = dataBuffer[11];
            receivedData.CR = dataBuffer[12];
            receivedData.LF = dataBuffer[13];

            // Reset buffer index
            //dataIndex = 0;
            // Check for end of message (carriage return and line feed)
            //if (receivedData.CR  == 0x0D && receivedData.LF == 0x0A) {
							// Process received data
							// Decode digits and combine into a single number
							combinedNumber = 0;
							combinedNumber += decodeDigit(receivedData.digit4) * 10000;
							combinedNumber += decodeDigit(receivedData.digit3) * 1000;
							combinedNumber += decodeDigit(receivedData.digit2) * 100;
							combinedNumber += decodeDigit(receivedData.digit1) * 10;
							combinedNumber += decodeDigit(receivedData.digit0);
							
							// Copy receivedData elements to test array starting from index 200
							test[200] = receivedData.range;
							test[201] = receivedData.digit4;
							test[202] = receivedData.digit3;
							test[203] = receivedData.digit2;
							test[204] = receivedData.digit1;
							test[205] = receivedData.digit0;
							test[206] = receivedData.function;
							test[207] = receivedData.status;
							test[208] = receivedData.option1;
							test[209] = receivedData.option2;
							test[210] = receivedData.option3;
							test[211] = receivedData.option4;
							test[212] = receivedData.CR;
							test[213] = receivedData.LF;
							
							// Store the combined number in the test array as 16-bit values
							test[214] = (combinedNumber >> 16) & 0xFFFF;
							test[215] = combinedNumber & 0xFFFF;

							// Convert resistance value to bytes and store in i2c_send_buf
							i2c_send[0] = (uint8_t)(combinedNumber >> 24);
							i2c_send[1] = (uint8_t)(combinedNumber >> 16);
							i2c_send[2] = (uint8_t)(combinedNumber >> 8);
							i2c_send[3] = (uint8_t)combinedNumber;

							// Store the range in the fifth byte
							i2c_send[4] = receivedData.range;

							// Store the channel in the sixth byte
							i2c_send[5] = multiChannel;
							
	//						// Store the sequence number in the seventh byte
	//						i2c_send[6] = sequenceNumber;
	
							//
							i2c_send[6] = receivedData.function;

	//						// Increment the sequence number for the next message
	//						sequenceNumber++;

							// Set the flag to indicate that serial data has been received
							receivedSerialData = 1;
//						}else {
//                // If the last two bytes are not CR and LF, discard the packet
//                dataIndex = 0;
//            }
        }
				
        // Set the flag to indicate that serial data has been received
        receivedSerialData = 1;	

        // Prevent buffer overflow
        if (dataIndex >= sizeof(dataBuffer)) {
            dataIndex = 0;
        }				

        // Clear the USART3 receive interrupt
        USART_ClearITPendingBit(USART3, USART_IT_RXNE);
    }
}

void SetMode(uint8_t mode) {
    // Ensure PB13 is high and PA5 is high at the start
    //GPIO_SetBits(GPIOB, GPIO_Pin_13); // PB13 high
    GPIO_SetBits(GPIOA, GPIO_Pin_5);  // PA5 high  // FC5 is low, negative voltage means FC5 is low
    ControlSW1(mode == MODE_AC_VOLTAGE_MEASUREMENT);

    i2c_send[7]++;

