temcocontrols/T3-programmable-controller-on-ESP32/STM32/Multimeter/USER/ES51932_Driver.c
    switch (mode) {
        case 0:
            // DC Voltage Measurement
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for voltage measurement
            break;
        case 1:
            // Auto DC Current Measurement(µA)
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 2:
            // Auto DC Current Measurement(mA)
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 3:
            // 322A DC Current Measurement(A)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 4:
            // DC 220.00mV
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for voltage measurement
            break;
        case 5:
            // Manual DC 22.000A
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 6:
            // Manual DC 220.00A
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 7:
            // Manual DC 2200.0A
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 8:
            // Manual DC 22000A
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 9:
            // Resistance Measurement
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 1, 1, 0);          // Set switches for resistance measurement
            break;
        case 10:
            // Continuity Check
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 1, 1, 0);          // Set switches for continuity check
            break;
        case 11:
            // Diode Measurement
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 1, 1, 0);          // Set switches for diode measurement
            break;
        case 12:
            // Frequency Measurement
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 1);          // Set switches for frequency measurement
            break;
        case 13:
            // Capacitance Measurement
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 1, 1, 0);          // Set switches for capacitance measurement
            break;
        case 14:
            // Temperature Measurement (oC)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for temperature measurement
            break;
        case 15:
            // Resistance Measurement (Alternative)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 1, 1, 0);          // Set switches for resistance measurement
            break;
        case 16:
            // AC Voltage Measurement
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for voltage measurement
            break;
        case 17:
            // Auto AC Current Measurement(µA)
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 18:
            // Auto AC Current Measurement(mA)
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 19:
            // 322A AC Current Measurement(A)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 20:
            // AC 220.00mV
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for voltage measurement
            break;
        case 21:
            // Manual AC 22.000A
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 22:
            // Manual AC 220.00A
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 23:
            // Manual AC 2200.0A
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 24:
            // Manual AC 22000A
            GPIO_SetBits(GPIOA, GPIO_Pin_12);     // FC1 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_11);   // FC2 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for current measurement
            break;
        case 25:
            // ADP0(22000)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(1, 0, 0, 0);          // Set switches for ADP measurement
            break;
        case 26:
            // ADP1(2200.0)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(1, 0, 0, 0);          // Set switches for ADP measurement
            break;
        case 27:
            // ADP2(220.00)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(1, 0, 0, 0);          // Set switches for ADP measurement
            break;
        case 28:
            // ADP3(22.000)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(1, 0, 0, 0);          // Set switches for ADP measurement
            break;
        case 29:
            // ADP4(2.2000)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_SetBits(GPIOA, GPIO_Pin_7);      // FC3 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_6);    // FC4 low
            ControlSwitches(1, 0, 0, 0);          // Set switches for ADP measurement
            break;
        case 30:
            // Temperature Measurement (oF)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 0, 0, 0);          // Set switches for temperature measurement
            break;
        case 31:
            // Capacitance Measurement (Clamp)
            GPIO_ResetBits(GPIOA, GPIO_Pin_12);   // FC1 low
            GPIO_SetBits(GPIOA, GPIO_Pin_11);     // FC2 high
            GPIO_ResetBits(GPIOA, GPIO_Pin_7);    // FC3 low
            GPIO_SetBits(GPIOA, GPIO_Pin_6);      // FC4 high
            ControlSwitches(0, 1, 1, 0);          // Set switches for capacitance measurement
            break;
        default:
            // Invalid mode, set all FC pins to high (1)
            GPIO_SetBits(GPIOA, GPIO_Pin_12 | GPIO_Pin_11 | GPIO_Pin_7 | GPIO_Pin_6);
            break;
    }

    test[240] = mode;
    test[241] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_13); // SLACDC
    test[242] = GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_5);  // FC5
    test[243] = GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_12); // FC1
    test[244] = GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_11); // FC2
    test[245] = GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_7);  // FC3
    test[246] = GPIO_ReadOutputDataBit(GPIOA, GPIO_Pin_6);  // FC4
}

void SetSLACDC(uint8_t mode) {
    if (mode == SELECT_DC) {
        // Set PB13 high for SELECT_DC
        GPIO_SetBits(GPIOB, GPIO_Pin_13);
        GPIO_SetBits(GPIOB, GPIO_Pin_14); // PB14 low for DC
    } else if (mode == SELECT_AC) {
        // Set PB13 low for SELECT_AC
        GPIO_ResetBits(GPIOB, GPIO_Pin_13);
        GPIO_ResetBits(GPIOB, GPIO_Pin_14); // PB14 high for AC
    }

    test[247] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_13);
    test[262] = GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_14);
}
